<!-- dflook/terraform-github-actions {"workspace":"hide-outdated","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"0d5f6c34f46e88909321d4280f2e17a2f172646385435a108a70eab4dc05b223","plan_job_ref":"Job Test plan target and replace #429 at https://github.com/dflook/terraform-github-actions/actions/runs/10218310680","plan_hash":"6de1c5553bfaee811edbb8e552cea55eec3a18576a1de2856b714a914dbc48ef","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __hide-outdated__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "r87TvfQ2cM" -> (known after apply)
!~  foreach = "gR9gbl70eo" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #429](https://github.com/dflook/terraform-github-actions/actions/runs/10218310680)